In [3]:
import pandas as pd
import shortuuid
from sqlalchemy import create_engine

In [4]:
df = pd.read_csv('dataset/cleaned_nur_data.csv', index_col=0)
df.head()

,name,location,rank,description,tuition_and_fees,in_state,undergrad_enrollment,state,year,state_full,region
index,,,,,,,,,,,
0,Princeton University,"Princeton, NJ",1,"Princeton, the fourth-oldest college in the Un...",45320,0,5402,NJ,0,New Jersey,Northeast
1,Harvard University,"Cambridge, MA",2,"Harvard is located in Cambridge, Massachusetts...",47074,0,6699,MA,0,Massachusetts,Northeast
2,University of Chicago,"Chicago, IL",3,"The University of Chicago, situated in Chicago...",52491,0,5844,IL,0,Illinois,Midwest
3,Yale University,"New Haven, CT",3,"Yale University, located in New Haven, Connect...",49480,0,5532,CT,0,Connecticut,Northeast
4,Columbia University,"New York, NY",5,"Columbia University, located in Manhattan's Mo...",55056,0,6102,NY,0,New York,Northeast

In [9]:
user_state = 'NJ'
state_reg = df[df['state'] == user_state]['region'][0]
print(f'{user_state} is in the {state_reg}')

NJ is in the Northeast

In [8]:
def generate_rank_id(row):
    concat_str = str(row['rank']) + str(row['name'])
    unique_id = shortuuid.uuid(name=concat_str)
    return unique_id

def generate_school_id(row):
    concat_str = str(row['name']) + str(row['location'])
    unique_id = shortuuid.uuid(name=concat_str)
    return unique_id

In [10]:
df_nur = df.copy()
df_nur = df_nur.rename(columns={'state': 'state_id'})
df_nur['rank_id'] = df_nur.apply(generate_rank_id, axis=1)
df_nur['school_id'] = df_nur.apply(generate_school_id, axis=1)
df_nur.head(3)

,name,location,rank,description,tuition_and_fees,in_state,undergrad_enrollment,state_id,year,state_full,region,rank_id,school_id
index,,,,,,,,,,,,,
0,Princeton University,"Princeton, NJ",1,"Princeton, the fourth-oldest college in the Un...",45320,0,5402,NJ,0,New Jersey,Northeast,Eq5cQV4hKkFR6z2MfWxEqc,Lr2R5kZceTU4pdjUnocLDg
1,Harvard University,"Cambridge, MA",2,"Harvard is located in Cambridge, Massachusetts...",47074,0,6699,MA,0,Massachusetts,Northeast,EkYNgT2BHJsCyyswYys6Vw,UdJi2dnSZPoorgUFCaSU5h
2,University of Chicago,"Chicago, IL",3,"The University of Chicago, situated in Chicago...",52491,0,5844,IL,0,Illinois,Midwest,XVqUGZZRK7ERHTrVRBrRTL,BGe6nZUAjMJF8Wf9e5ETiv

In [13]:
north = df_nur[df_nur['region'] == 'Northeast'][['school_id', 'name', 'location', 'description', 'year', 'state_id', 'rank_id']]
north.head(3)

,school_id,name,location,description,year,state_id,rank_id
index,,,,,,,
0,Lr2R5kZceTU4pdjUnocLDg,Princeton University,"Princeton, NJ","Princeton, the fourth-oldest college in the Un...",0,NJ,Eq5cQV4hKkFR6z2MfWxEqc
1,UdJi2dnSZPoorgUFCaSU5h,Harvard University,"Cambridge, MA","Harvard is located in Cambridge, Massachusetts...",0,MA,EkYNgT2BHJsCyyswYys6Vw
3,As2TQYBMzpSvppbnDYN5cu,Yale University,"New Haven, CT","Yale University, located in New Haven, Connect...",0,CT,jzw2bCJay7xKHuy4QBEH7o

In [ ]:
engine = create_engine('postgresql://xxxxx:xxxxx@xxxxx/nur_db')

In [ ]:
# Replace 'your_schema_name' with the name of the schema where your table exists
schema_name = 'nur_app'

# Replace 'your_table_name' with the name of the table in your schema where you want to insert the data
table_name = 'northeast'

# Use the to_sql method to insert the data
north.to_sql(name=table_name, con=engine, schema=schema_name, if_exists='replace', index=False)